Tekla.Structures.Plugins.DirectManipulation.Core.Features.CustomPartPluginCreationFeatureBase
The Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartCreationFeatureBase class provides the base class for creation features for plugins.
Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartCreationFeatureBase

Tekla.Structures.Plugins.DirectManipulation.Core.Features.CustomPartPluginCreationFeatureBase.#ctor(System.String,System.Boolean,System.Int32)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Core.Features.CustomPartPluginCreationFeatureBase class.
name: The name of the custom part.
useFeatureContextualToolBar:
The System.Boolean value to indicate whether the feature level contextual toolbar should be used.
inputPointCount: The number of input points of the custom part.